---
kind: property
id: P:Autodesk.Revit.DB.TextNode.FontHeight
source: html/43cb3a02-7a48-8aaa-2297-fc35c53cf19f.htm
---
# Autodesk.Revit.DB.TextNode.FontHeight Property

Height [ft] of the text font, in model space.

## Syntax (C#)
```csharp
public double FontHeight { get; }
```

## Remarks
This is the height of the 'M' glyph in the text font.